#+STARTUP: overview
#+TITLE: nur-packages
#+AUTHOR: natsukium

My personal [[https://github.com/nix-community/NUR][NUR]] repository

[[Build and populate cache][https://github.com/natsukium/nur-packages/actions/workflows/build.yml/badge.svg]]

[[https://natsukium.cachix.org][https://img.shields.io/badge/cachix-natsukium-blue.svg]]

** Packages

#+begin_src shell :results output table :exports results
echo Package, Description, Homepage, Platforms, License
nix eval --raw .#packages.x86_64-linux \
    --apply 'ps:
builtins.concatStringsSep "\n" (
  builtins.map
    (
      p:
      "${ps.${p}.meta.name}, ${ps.${p}.meta.description}, ${ps.${p}.meta.homepage}, ${
        builtins.concatStringsSep " / " (
          builtins.filter (
            x: x == "x86_64-linux" || x == "aarch64-linux" || x == "x86_64-darwin" || x == "aarch64-darwin"
          ) ps.${p}.meta.platforms
        )
      }, ${ps.${p}.meta.license.shortName}"
    )
    (
      builtins.filter (x: !(x == "lib" || x == "modules" || x == "overlays" || x == "vimPlugins")) (
        builtins.attrNames ps
      )
    )
)'
#+end_src

#+RESULTS:
| Package | Description | Homepage | Platforms | License |
